app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT "users".* FROM "users" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "users"

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["name", "New Name"], ["email", "new@example.com"], ["password_digest", "$2a$04$MwmXRczuHrnsnWQRq3xXe.E/UqcOePmNLv8SPyOrwiDVR1Ahhbxgm"], ["updated_at", Fri, 10 Oct 2014 00:15:35 UTC +00:00]]